{"command.restartServer":"Sunucuyu Yeniden Başlatın","extension.description":"Black biçimlendirici kullanan Python dosyaları için biçimlendirme desteği.","settings.args.description":"Python dosyalarını biçimlendirmek için Black'e geçirilen bağımsız değişkenler. Her bağımsız değişken dizide ayrı bir dize olarak sağlanmalıdır. \n Örnek: \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Python dosyalarını Black ile biçimlendirmek için kullanılan geçerli çalışma dizinini ayarlar. Varsayılan olarak, '${workspaceFolder}' çalışma alanının kök dizinini kullanır. Black için çalışma dizini olarak biçimlendirilen dosyanın üst klasörünü kullanmak için `${fileDirname}` olarak ayarlayabilirsiniz.","settings.importStrategy.description":"Python dosyalarını biçimlendirmek için kullanılacak Siyah biçimlendirici ikili dosyasını tanımlar. `useBundled` olarak ayarlandığında uzantı, uzantıyla birlikte gönderilen Black biçimlendirici ikili dosyasını kullanır. 'fromEnvironment' olarak ayarlandığında uzantı, Black biçimlendirici ikili dosyasını ve şu anda seçili olan ortamda kullanılabilen tüm bağımlılıkları kullanmaya çalışılır. **Not**: Uzantı, seçili ortamda geçerli bir Black biçimlendirici ikili dosyası bulamazsa, uzantıyla birlikte gönderilen ikili dosyayı kullanmaya geri döner. `black-formatter.path` ayarı önceliklidir ve `black-formatter.importStrategy` davranışını geçersiz kılar.","settings.importStrategy.fromEnvironment.description":"Seçili Python ortamındaki Siyah ikili dosyayı kullanın. Uzantı geçerli bir Black ikili dosyası bulamazsa, Black'in paketlenmiş sürümünü kullanmaya geri döner.","settings.importStrategy.useBundled.description":"Python dosyalarını biçimlendirmek için her zaman Black'in paketlenmiş sürümünü kullanın.","settings.interpreter.description":"Black sunucusunu ve herhangi bir alt işlemi başlatmak için kullanılacak bir Python yürütülebilir dosyasının veya komutun yolu. Tek veya birden çok dizenin dizisini kabul eder. `[]` olarak ayarlandığında, uzantı seçili Python yorumlayıcısının yolunu kullanır. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır.","settings.path.description":"Python dosyalarını Black ile biçimlendirmek için uzantı tarafından kullanılacak yol veya komut. Tek veya birden çok dizenin dizisini kabul eder. Komut geçiriliyorsa her bağımsız değişken dizide ayrı birer dize olarak sağlanmalıdır. `[\"black\"]` olarak ayarlanırsa, `PATH` ortam değişkeninde bulunan Black sürümünü kullanır. Not: Bu seçeneğin kullanılması biçimlendirme işlemini yavaşlatabilir. \n  Örnekler: \n  - `[\"~/global_env/black\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Black sunucusu tarafından kullanılacak aktarım protokolünü seçer. `stdio` olarak ayarlandığında uzantı, Black sunucusuyla iletişim kurmak için standart giriş/çıkış akışlarını kullanır. 'pipe' olarak ayarlandığında uzantı, Black sunucusuyla iletişim kurmak için bir adlandırılmış kanal (Windows üzerinde) veya Unix Etki Alanı Yuvası (Linux/Mac üzerinde) kullanır. 'stdio' aktarım protokolü, çoğu kullanıcı için varsayılan ve önerilen seçenektir.","settings.serverTransport.pipe.description":"Black sunucusuyla iletişim kurmak için adlandırılmış kanal (windows üzerinde) ve Unix Etki Alanı Yuvası (linux/mac üzerinde) kullanın.","settings.serverTransport.stdio.description":"Black sunucusuyla iletişim kurmak için standart giriş/çıkış akışlarını kullanın.","settings.showNotifications.always.description":"Bildirimler, Python dosyaları biçimlendirilirken, sunucunun göstermeyi seçtiği her şey için gösterilir.","settings.showNotifications.description":"Bildirimlerin bu uzantı tarafından ne zaman gösterileceğini kontrol eder.","settings.showNotifications.off.description":"Tüm bildirimler kapatıldı, Python dosyaları biçimlendirilirken tüm hatalar veya uyarılar hâlâ günlüklerde mevcuttur.","settings.showNotifications.onError.description":"Bildirimler, yalnızca Python dosyaları biçimlendirilirken bir hata oluşması durumunda gösterilir.","settings.showNotifications.onWarning.description":"Python dosyaları biçimlendirilirken hatalar ve uyarılar için bildirimler gösterilir."}
