{"command.restartServer":"Restartovat server","extension.description":"Podpora formátování souborů Pythonu pomocí formátovacího modulu Black.","settings.args.description":"Argumenty předané formátovacímu modulu Black pro formátování souborů Pythonu Každý argument by měl být v poli zadán jako samostatný řetězec. \n Příklad: \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Nastaví aktuální pracovní adresář, který se používá k formátování souborů Pythonu pomocí formátovacího modulu Black. Standardně používá kořenový adresář pracovního prostoru ${workspaceFolder}. Můžete ho nastavit na ${fileDirname}, aby se jako pracovní adresář pro Black použila nadřazená složka souboru, který se formátuje.","settings.importStrategy.description":"Definuje, který binární soubor formátovacího modulu Black se má použít k formátování souborů Pythonu. Pokud je nastaveno na useBundled, rozšíření použije binární soubor formátovacího modulu Black, který je dodáván s rozšířením. Při nastavení na fromEnvironment se rozšíření pokusí použít binární soubor formátovacího modulu Black a všechny závislosti, které jsou k dispozici v aktuálně vybraném prostředí. **Poznámka**: Pokud rozšíření nemůže ve vybraném prostředí platný binární soubor formátovacího modulu Black najít, použije místo toho binární soubor dodávaný s rozšířením. Poznámka: Nastavení black-formatter.path má přednost a přepíše chování black-formatter.importStrategy.","settings.importStrategy.fromEnvironment.description":"Použijte binární soubor Black z vybraného prostředí Pythonu. Pokud rozšíření nenajde platný binární soubor Black, použije místo toho zkompletovanou verzi Black dodávanou s rozšířením.","settings.importStrategy.useBundled.description":"K formátování souborů Pythonu vždy použije dodávanou verzi souboru Black.","settings.interpreter.description":"Cesta ke spustitelnému souboru Pythonu nebo k příkazu, který se použije ke spuštění serveru Black a jakéhokoli podprocesu. Přijímá pole jednoho nebo více řetězců. Když se nastaví na [], rozšíření použije cestu k vybranému interpretu Pythonu. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli.","settings.path.description":"Cesta nebo příkaz, které má rozšíření použít k formátování souborů Pythonu pomocí formátovacího modulu Black. Přijímá pole jednoho nebo více řetězců. Při předání příkazu by měl být každý argument zadán jako samostatný řetězec v poli. Pokud je nastaveno na [\"black\"], použije se verze Black dostupná v proměnné prostředí PATH. Poznámka: Použití této možnosti může zpomalit formátování. \n  Příklady: \n  - `[\"~/global_env/black\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Vybere transportní protokol, který má server Black používat. Pokud je nastaveno na stdio, bude rozšíření ke komunikaci se serverem Black používat standardní vstupní/výstupní streamy. Pokud je nastaveno na pipe, bude rozšíření ke komunikaci se serverem Black používat pojmenovaný kanál (ve Windows) nebo Unix Domain Socket (v Linuxu / na Macu). Transportní protokol stdio je výchozí a doporučenou možností pro většinu uživatelů.","settings.serverTransport.pipe.description":"Ke komunikaci se serverem Black použijte pojmenovaný kanál (ve Windows) a Unix Domain Socket (v Linuxu / na Macu).","settings.serverTransport.stdio.description":"Ke komunikaci se serverem Black použijte standardní vstupní a výstupní streamy.","settings.showNotifications.always.description":"Oznámení se zobrazují pro všechno, co se server rozhodne zobrazit při formátování souborů Pythonu.","settings.showNotifications.description":"Určuje, kdy toto rozšíření zobrazuje oznámení.","settings.showNotifications.off.description":"Všechna oznámení jsou vypnuta, všechny chyby nebo upozornění při formátování souborů Pythonu jsou však dostupné v protokolech.","settings.showNotifications.onError.description":"Oznámení se zobrazují jenom v případě chyby při formátování souborů Pythonu.","settings.showNotifications.onWarning.description":"Při formátování souborů Pythonu se zobrazují oznámení o všech chybách a upozorněních."}
