{"command.restartServer":"Reiniciar Servidor","extension.description":"Suporte à formatação dos arquivos Python usando o formatador Black.","settings.args.description":"Argumentos passados para Black para formatar arquivos Python. Cada argumento deverá ser fornecido como uma cadeia de caracteres separada na matriz. \n Exemplo: \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Define o diretório de trabalho atual usado para formatar arquivos Python com Black. Por padrão, ele usa o diretório raiz do workspace “${workspaceFolder}”. Você pode configurá-lo para “${fileDirname}” para usar a pasta pai do arquivo que está sendo formatado como o diretório de trabalho para Black.","settings.importStrategy.description":"Define qual binário de formatador Black será usado para formatar arquivos Python. Quando definida como \"useBundled\", a extensão usará o binário de formatador Black que é enviado com ela. Quando definida como \"fromEnvironment\", a extensão tentará usar o binário de formatador Black e todas as dependências disponíveis no ambiente selecionado no momento. **Observação**: se a extensão não encontrar um binário de formatador Black válido no ambiente selecionado, fará fallback para usar o binário fornecido com ela. A configuração \"black-formattter.path\" tem precedência e substitui o comportamento de \"black-formattter.importStrategy\".","settings.importStrategy.fromEnvironment.description":"Use o binário Black do ambiente Python selecionado. Se a extensão não encontrar um binário Black válido, ela voltará a usar a versão agrupada do Black.","settings.importStrategy.useBundled.description":"Sempre use a versão agrupada do Black para formatar arquivos Python.","settings.interpreter.description":"Caminho para um executável do Python ou um comando que será usado para iniciar o servidor Black e qualquer subprocesso. Aceita uma matriz de uma ou várias cadeias de caracteres. Quando definida como \"[]\", a extensão usará o caminho para o interpretador do Python selecionado. Se passar um comando, cada argumento deverá ser fornecido como uma cadeia de caracteres separada na matriz.","settings.path.description":"O caminho ou o comando a ser usado pela extensão para formatar arquivos Python com Black. Aceita uma matriz de uma ou várias cadeias de caracteres. Se passar um comando, cada argumento deverá ser fornecido como uma cadeia de caracteres separada na matriz. Se definido como `[\"mypy\"]`, ele usará a versão do Black disponível na variável de ambiente \"PATH\". Observação: usar essa opção pode tornar a formatação lenta. \n  Exemplos: \n  - `[\"~/global_env/black\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Seleciona o protocolo de transporte a ser usado pelo servidor Black. Quando definida como ''stdio'', a extensão usará os fluxos de entrada/saída padrão para se comunicar com o servidor Black. Quando definida como ''pipe'', a extensão usará um pipe nomeado (no Windows) ou um Soquete de Domínio Unix (em Linux/Mac) para se comunicar com o servidor Black. O protocolo de transporte ''stdio'' é a opção padrão e recomendada para a maioria dos usuários.","settings.serverTransport.pipe.description":"Use um pipe nomeado (no Windows) e um Soquete de Domínio Unix (no Linux/Mac) para se comunicar com o servidor Black.","settings.serverTransport.stdio.description":"Use os fluxos de entrada/saída padrão para se comunicar com o servidor Black.","settings.showNotifications.always.description":"As notificações são mostradas para qualquer coisa que o servidor opte por mostrar ao formatar arquivos Python.","settings.showNotifications.description":"Controla quando as notificações são mostradas por esta extensão.","settings.showNotifications.off.description":"Todas as notificações são desativadas e quaisquer erros ou avisos ao formatar arquivos Python ainda estão disponíveis nos logs.","settings.showNotifications.onError.description":"As notificações são mostradas somente no caso de um erro ao formatar arquivos Python.","settings.showNotifications.onWarning.description":"As notificações são mostradas para quaisquer erros e avisos ao formatar arquivos Python."}
