{"command.restartServer":"Redémarrer le serveur","extension.description":"Prise en charge du formatage des fichiers Python à l’aide du formateur Black.","settings.args.description":"Arguments passés à Black pour la mise en forme des fichiers Python. Chaque argument doit être fourni en tant que chaîne distincte dans le tableau. \n Exemple : \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Définit le répertoire de travail actuel utilisé pour formater les fichiers Python avec Black. Par défaut, il utilise le répertoire racine de l'espace de travail `${workspaceFolder}`. Vous pouvez le définir sur `${fileDirname}` pour utiliser le dossier parent du fichier en cours de formatage comme répertoire de travail pour Black.","settings.importStrategy.description":"Définit le binaire du formateur Black à utiliser pour mettre en forme des fichiers Python. Lorsque la valeur est « useBundled », l’extension utilise le binaire de formateur Black fourni avec l’extension. Lorsqu’elle est définie sur `fromEnvironment`, l’extension tente d’utiliser le binaire du formateur Black et toutes les dépendances disponibles dans l’environnement actuellement sélectionné. **Remarque** : si l’extension ne trouve pas de binaire de formateur Black valide dans l’environnement sélectionné, elle revient à l’utilisation du binaire fourni avec l’extension. Le paramètre « black-formatter.path » est prioritaire et remplace le comportement de « black-formatter.importStrategy ».","settings.importStrategy.fromEnvironment.description":"Utilisez le binaire Black de l’environnement Python sélectionné. Si l’extension ne parvient pas à trouver un binaire Black valide, elle utilise la version groupée de Black.","settings.importStrategy.useBundled.description":"Utilisez toujours la version groupée de Black pour mettre en forme des fichiers Python.","settings.interpreter.description":"Chemin d’un exécutable Python ou d’une commande qui sera utilisée pour lancer le serveur Black et tous les sous-processus. Accepte un tableau d’une ou plusieurs chaînes. Quand la valeur est '[]', l’extension utilise le chemin de l’interpréteur Python sélectionné. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau.","settings.path.description":"Chemin d’accès ou commande à utiliser par l’extension pour mettre en forme des fichiers Python avec Black. Accepte un tableau d’une ou plusieurs chaînes. Si vous passez une commande, chaque argument doit être fourni sous la forme d’une chaîne distincte dans le tableau. Si la valeur est `[\"black\"]`, elle utilise la version de Black disponible dans la variable d’environnement `PATH`. Remarque : l’utilisation de cette option peut ralentir la mise en forme. \n  Exemples : \n  - '[\"~/global_env/black\"]' \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Permet de sélectionner le protocole de transport à utiliser par le serveur noir. Quand la valeur est définies sur `stdio`, l’extension utilise les flux d’entrée/sortie standard pour communiquer avec le serveur noir. Quand la valeur est définies sur `pipe`, l’extension utilise un canal nommé (sur Windows) ou un socket de domaine Unix (sur Linux/Mac) pour communiquer avec le serveur noir. Le protocole de transport `stdio` est l’option par défaut et celle recommandée pour la plupart des utilisateurs.","settings.serverTransport.pipe.description":"Utilisez un canal nommé (sur Windows) et un socket de domaine Unix (sur Linux/mac) pour communiquer avec le serveur noir.","settings.serverTransport.stdio.description":"Utilisez les flux d’entrée/sortie standard pour communiquer avec le serveur noir.","settings.showNotifications.always.description":"Les notifications s’affichent pour tout ce que le serveur choisit d’afficher lors de la mise en forme des fichiers Python.","settings.showNotifications.description":"Contrôle quand les notifications sont affichées par cette extension.","settings.showNotifications.off.description":"Toutes les notifications sont désactivées, les erreurs ou avertissements lors de la mise en forme des fichiers Python sont toujours disponibles dans les journaux.","settings.showNotifications.onError.description":"Les notifications s’affichent uniquement en cas d’erreur lors de la mise en forme des fichiers Python.","settings.showNotifications.onWarning.description":"Les notifications s’affichent pour les erreurs et avertissements lors de la mise en forme des fichiers Python."}
