{"command.restartServer":"Reiniciar servidor","extension.description":"Compatibilidad con formato para archivos de Python con formateador Black.","settings.args.description":"Argumentos pasados a Black para dar formato a los archivos de Python. Cada argumento debe proporcionarse como una cadena independiente en la matriz. \n Ejemplo: \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Establezca el directorio de trabajo actual que se usa para dar formato a los archivos de Python con Black. De manera predeterminada, se utiliza el directorio raíz del área de trabajo \"${workspaceFolder}\". Puede establecerlo en \"${fileDirname}\" para usar la carpeta principal del archivo que se está formateando como directorio de trabajo para Black.","settings.importStrategy.description":"Define qué binario de formateador negro se usará para dar formato a los archivos de Python. Cuando se establece en \"useBundled\", la extensión usará el binario de formateador Black que se incluye con la extensión. Cuando se establece en \"fromEnvironment\", la extensión intentará usar el binario de formateador Black y todas las dependencias que están disponibles en el entorno seleccionado actualmente.**Nota**: Si la extensión no encuentra un binario de formateador Black válido en el entorno seleccionado, se revertirá al uso del binario que se incluye con la extensión. El valor \"black-formatter.path\" tiene prioridad e invalida el comportamiento de \"black-formatter.importStrategy\".","settings.importStrategy.fromEnvironment.description":"Use el binario de Black del entorno de Python seleccionado. Si la extensión no encuentra un binario de Black válido, volverá a usar la versión empaquetada de Black.","settings.importStrategy.useBundled.description":"Use siempre la versión empaquetada de Black para dar formato a los archivos de Python.","settings.interpreter.description":"Ruta de acceso a un ejecutable de Python o un comando que se usará para iniciar el servidor Black y cualquier subproceso. Acepta una matriz de una o varias cadenas. Cuando se establece en '[]', la extensión usará la ruta de acceso al intérprete de Python seleccionado. Si pasa un comando, cada argumento debe proporcionarse como una cadena independiente en la matriz.","settings.path.description":"Ruta de acceso o comando que usará la extensión para dar formato a los archivos de Python con Black. Acepta una matriz de una o varias cadenas. Si pasa un comando, cada argumento debe proporcionarse como una cadena independiente en la matriz. Si se establece en \"[\"black\"]\", usará la versión de Black disponible en la variable de entorno \"PATH\". Nota: El uso de esta opción puede ralentizar el formato. \n  Ejemplos: \n  - `[\"~/global_env/black\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Selecciona el protocolo de transporte que usará el servidor Black. Cuando se establece en \"stdio\", la extensión usará las secuencias de entrada y salida estándar para comunicarse con el servidor Black. Cuando se establece en \"pipe\", la extensión usa una canalización con nombre (en Windows) o un socket de dominio Unix (en Linux/Mac) para comunicarse con el servidor Black. El protocolo de transporte 'stdio' es la opción predeterminada y recomendada para la mayoría de los usuarios.","settings.serverTransport.pipe.description":"Use una canalización con nombre (en Windows) y un socket de dominio Unix (en Linux/Mac) para comunicarse con el servidor Black.","settings.serverTransport.stdio.description":"Use las secuencias de entrada/salida estándares para comunicarse con el servidor Black.","settings.showNotifications.always.description":"Las notificaciones se muestran para cualquier cosa que el servidor elija mostrar al dar formato a los archivos de Python.","settings.showNotifications.description":"Controla cuándo se muestran las notificaciones mediante esta extensión.","settings.showNotifications.off.description":"Todas las notificaciones están desactivadas, los errores o las advertencias al formatear archivos de Python siguen estando disponibles en los registros.","settings.showNotifications.onError.description":"Las notificaciones solo se muestran en caso de error al dar formato a archivos de Python.","settings.showNotifications.onWarning.description":"Se muestran notificaciones de los errores y advertencias al dar formato a archivos de Python."}
