{"command.restartServer":"Rëstært §ërvër","extension.description":"Førmættïñg sµppørt før Pÿthøñ fïlës µsïñg thë ßlæçk førmættër.","settings.args.description":"Ærgµmëñts pæssëð tø ßlæçk tø førmæt Pÿthøñ fïlës. Ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. \n Ëxæmplë: \n `\"þlæçk-førmættër.ærgs\" = [\"--çøñfïg\", \"<fïlë>\"]`","settings.cwd.description":"§ëts thë çµrrëñt wørkïñg ðïrëçtørÿ µsëð tø førmæt Pÿthøñ fïlës wïth ßlæçk. ßÿ ðëfæµlt, ït µsës thë røøt ðïrëçtørÿ øf thë wørkspæçë `${wørkspæçëFølðër}`. Ýøµ çæñ sët ït tø `${fïlëÐïrñæmë}` tø µsë thë pærëñt følðër øf thë fïlë þëïñg førmættëð æs thë wørkïñg ðïrëçtørÿ før ßlæçk.","settings.importStrategy.description":"Ðëfïñës whïçh ßlæçk førmættër þïñærÿ tø þë µsëð tø førmæt Pÿthøñ fïlës. Whëñ sët tø `µsëßµñðlëð`, thë ëxtëñsïøñ wïll µsë thë ßlæçk førmættër þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ. Whëñ sët tø `frømËñvïrøñmëñt`, thë ëxtëñsïøñ wïll ættëmpt tø µsë thë ßlæçk førmættër þïñærÿ æñð æll ðëpëñðëñçïës thæt ærë ævæïlæþlë ïñ thë çµrrëñtlÿ sëlëçtëð ëñvïrøñmëñt. **Ñøtë**: Ïf thë ëxtëñsïøñ çæñ't fïñð æ vælïð ßlæçk førmættër þïñærÿ ïñ thë sëlëçtëð ëñvïrøñmëñt, ït wïll fællþæçk tø µsïñg thë þïñærÿ thæt ïs shïppëð wïth thë ëxtëñsïøñ. Thë `þlæçk-førmættër.pæth` sëttïñg tækës prëçëðëñçë æñð øvërrïðës thë þëhævïør øf `þlæçk-førmættër.ïmpørt§trætëgÿ`.","settings.importStrategy.fromEnvironment.description":"Üsë thë ßlæçk þïñærÿ frøm thë sëlëçtëð Pÿthøñ ëñvïrøñmëñt. Ïf thë ëxtëñsïøñ fæïls tø fïñð æ vælïð ßlæçk þïñærÿ, ït wïll fællþæçk tø µsïñg thë þµñðlëð vërsïøñ øf ßlæçk.","settings.importStrategy.useBundled.description":"Ælwæÿs µsë thë þµñðlëð vërsïøñ øf ßlæçk tø førmæt Pÿthøñ fïlës.","settings.interpreter.description":"Pæth tø æ Pÿthøñ ëxëçµtæþlë ør æ çømmæñð thæt wïll þë µsëð tø læµñçh thë ßlæçk sërvër æñð æñÿ sµþprøçëss. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs. Whëñ sët tø `[]`, thë ëxtëñsïøñ wïll µsë thë pæth tø thë sëlëçtëð Pÿthøñ ïñtërprëtër. Ïf pæssïñg æ çømmæñð, ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ.","settings.path.description":"Pæth ør çømmæñð tø þë µsëð þÿ thë ëxtëñsïøñ tø førmæt Pÿthøñ fïlës wïth ßlæçk. Æççëpts æñ ærræÿ øf æ sïñglë ør mµltïplë strïñgs. Ïf pæssïñg æ çømmæñð, ëæçh ærgµmëñt shøµlð þë prøvïðëð æs æ sëpærætë strïñg ïñ thë ærræÿ. Ïf sët tø `[\"þlæçk\"]`, ït wïll µsë thë vërsïøñ øf ßlæçk ævæïlæþlë ïñ thë `PÆTH` ëñvïrøñmëñt værïæþlë. Ñøtë: Üsïñg thïs øptïøñ mæÿ sløwðøwñ førmættïñg. \n  Ëxæmplës: \n  - `[\"~/gløþæl_ëñv/þlæçk\"]` \n  - `[\"çøñðæ\", \"rµñ\", \"-ñ\", \"lïñt_ëñv\", \"pÿthøñ\", \"-m\", \"þlæçk\"]`","settings.serverTransport.description":"§ëlëçts thë træñspørt prøtøçøl tø þë µsëð þÿ thë ßlæçk sërvër. Whëñ sët tø `stðïø`, thë ëxtëñsïøñ wïll µsë thë stæñðærð ïñpµt/øµtpµt strëæms tø çømmµñïçætë wïth thë ßlæçk sërvër. Whëñ sët tø `pïpë`, thë ëxtëñsïøñ wïll µsë æ ñæmëð pïpë (øñ Wïñðøws) ør Üñïx Ðømæïñ §øçkët (øñ £ïñµx/Mæç) tø çømmµñïçætë wïth thë ßlæçk sërvër. Thë `stðïø` træñspørt prøtøçøl ïs thë ðëfæµlt æñð rëçømmëñðëð øptïøñ før møst µsërs.","settings.serverTransport.pipe.description":"Üsë æ ñæmëð pïpë (øñ wïñðøws) æñð Üñïx Ðømæïñ §øçkët (øñ lïñµx/mæç) tø çømmµñïçætë wïth thë ßlæçk sërvër.","settings.serverTransport.stdio.description":"Üsë thë stæñðærð ïñpµt/øµtpµt strëæms tø çømmµñïçætë wïth thë ßlæçk sërvër.","settings.showNotifications.always.description":"Ñøtïfïçætïøñs ærë shøw før æñÿthïñg thæt thë sërvër çhøøsës tø shøw whëñ førmættïñg Pÿthøñ fïlës.","settings.showNotifications.description":"Çøñtrøls whëñ ñøtïfïçætïøñs ærë shøwñ þÿ thïs ëxtëñsïøñ.","settings.showNotifications.off.description":"Æll ñøtïfïçætïøñs ærë tµrñëð øff, æñÿ ërrørs ør wærñïñgs whëñ førmættïñg Pÿthøñ fïlës ærë stïll ævæïlæþlë ïñ thë løgs.","settings.showNotifications.onError.description":"Ñøtïfïçætïøñs ærë shøwñ øñlÿ ïñ thë çæsë øf æñ ërrør whëñ førmættïñg Pÿthøñ fïlës.","settings.showNotifications.onWarning.description":"Ñøtïfïçætïøñs ærë shøwñ før æñÿ ërrørs æñð wærñïñgs whëñ førmættïñg Pÿthøñ fïlës."}
