{"command.restartServer":"Riavvia server","extension.description":"Supporto della formattazione per i file Python con il formattatore Black.","settings.args.description":"Argomenti passati a Black per formattare i file Python. Ogni argomento deve essere fornito come stringa separata nella matrice. \n Esempio: \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Imposta la directory di lavoro corrente usata per formattare i file Python con Black. Per impostazione predefinita, usa la directory radice dell’area di lavoro `${workspaceFolder}`. È possibile impostare su `${fileDirname}` per usare la cartella padre del file per cui viene effettuata la formattazione come directory di lavoro perBlack.","settings.importStrategy.description":"Definisce il file binario del formattatore Black da usare per formattare i file Python. Quando impostata su `useBundled`, l'estensione userà il file binario del formattatore Black fornito con l'estensione. Se impostata su 'fromEnvironment', l'estensione tenterà di usare il file binario del formattatore Black e tutte le dipendenze disponibili nell'ambiente attualmente selezionato. **Nota**: se l'estensione non riesce a trovare un file binario formattatore Black valido nell'ambiente selezionato, verrà riportata all'uso del file binario fornito con l'estensione. L'impostazione 'black-formatter.path' ha la precedenza ed esegue l'override del comportamento di 'black-formatter.importStrategy'.","settings.importStrategy.fromEnvironment.description":"Usare il file binario nero dall'ambiente Python selezionato. Se l'estensione non riesce a trovare un file binario di Black valido, verrà eseguito il fallback all'uso della versione in bundle di Black.","settings.importStrategy.useBundled.description":"Usare sempre la versione in bundle di Black per formattare i file Python.","settings.interpreter.description":"Percorso di un eseguibile Python o di un comando che verrà usato per avviare il server Black e qualsiasi sottoprocesso. Accetta una matrice di una o più stringhe. Se impostata su '[]', l'estensione userà il percorso dell'interprete Python selezionato. Se si passa un comando, ogni argomento deve essere fornito come stringa separata nella matrice.","settings.path.description":"Percorso o comando che l'estensione deve usare per formattare i file Python con Black. Accetta una matrice di una o più stringhe. Se si passa un comando, ogni argomento deve essere fornito come stringa separata nella matrice. Se impostato su '[\"black\"]', userà la versione di Black disponibile nella variabile di ambiente 'PATH'. Nota: l'uso di questa opzione può rallentare la formattazione. \n  Esempi: \n  - `[\"~/global_env/black\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Seleziona il protocollo di trasporto da utilizzare per il server Black. Se questa opzione è impostata su 'stdio', l'estensione userà i flussi di input/output standard per comunicare con il server Black. Se impostata su 'pipe', l'estensione userà un named pipe (in Windows) o un socket di dominio Unix (in Linux/Mac) per comunicare con il server Black. Il protocollo di trasporto 'stdio' è l'opzione predefinita e consigliata per la maggior parte degli utenti.","settings.serverTransport.pipe.description":"Usa un named pipe (in Windows) e un socket di dominio Unix (in Linux/mac) per comunicare con il server Black.","settings.serverTransport.stdio.description":"Usa i flussi di input/output standard per comunicare con il server Black.","settings.showNotifications.always.description":"Le notifiche vengono visualizzate per tutti gli elementi che il server sceglie di visualizzare durante la formattazione dei file Python.","settings.showNotifications.description":"Controlla quando mostrare le notifiche da questa estensione.","settings.showNotifications.off.description":"Tutte le notifiche sono disattivate, ma eventuali errori o avvisi durante la formattazione dei file Python sono ancora disponibili nei log.","settings.showNotifications.onError.description":"Le notifiche vengono visualizzate solo in caso di errore durante la formattazione dei file Python.","settings.showNotifications.onWarning.description":"Le notifiche vengono visualizzate per eventuali errori e avvisi durante la formattazione dei file Python."}
