{"command.restartServer":"Перезапустить сервер","extension.description":"Поддержка форматирования файлов Python с использованием форматировщика Black.","settings.args.description":"Аргументы, передаваемые в Black для форматирования файлов Python. Каждый аргумент должен быть указан как отдельная строка в массиве. \n Пример: \n `\"black-formatter.args\" = [\"--config\", \"<file>\"]`","settings.cwd.description":"Устанавливает текущий рабочий каталог, используемый для форматирования файлов Python с помощью Black. По умолчанию используется корневой каталог рабочей области \"${workspaceFolder}\". Вы можете установить для него значение \"${fileDirname}\", чтобы использовать родительскую папку форматируемого файла в качестве рабочего каталога для Black.","settings.importStrategy.description":"Определяет двоичный файл форматировщика Black, который будет использоваться для форматирования файлов Python. Если настроено значение \"useBundled\", расширение будет использовать двоичный файл форматировщика Black, поставляемый вместе с расширением. Если настроено значение \"fromEnvironment\", расширение попытается использовать двоичный файл форматировщика Black и все зависимости, доступные в выбранной среде. **Примечание**. Если расширение не может найти допустимый двоичный файл форматировщика Black в выбранной среде, оно откатится к использованию двоичного файла, который поставляется с расширением. Параметр \"black-formatter.path\" имеет приоритет и переопределяет поведение \"black-formatter.importStrategy\".","settings.importStrategy.fromEnvironment.description":"Используйте двоичный файл Black из выбранной среды Python. Если расширению не удается найти допустимый двоичный файл Black, оно будет использовать пакетную версию Black.","settings.importStrategy.useBundled.description":"Для форматирования файлов Python всегда используйте пакетную версию Black.","settings.interpreter.description":"Путь к исполняемому файлу Python или команде, которая будет использоваться для запуска сервера Black и всех подпроцессов. Принимает массив из одной или нескольких строк. Если задано значение \"[]\", расширение будет использовать путь к выбранному интерпретатору Python. При передаче команды каждый аргумент должен быть указан как отдельная строка в массиве.","settings.path.description":"Путь или команда, используемые расширением для форматирования файлов Python с помощью Black. Принимает массив из одной или нескольких строк. При передаче команды каждый аргумент должен быть указан как отдельная строка в массиве. Если задан параметр [\"black\"], будет использоваться версия Black, доступная в переменной среды PATH. Примечание. Использование этого параметра может привести к замедлению форматирования. \n  Примеры: \n  - `[\"~/global_env/black\"]` \n  - `[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]`","settings.serverTransport.description":"Выбирает транспортный протокол, используемый сервером Black. Если настроено значение \"stdio\", расширение будет использовать стандартные потока ввода/вывода для связи с сервером Black. Если настроено значение \"pipe\", расширение будет использовать именованный канал (в Windows) или сокет домена Unix (на Linux/Mac) для связи с сервером Black. Транспортный протокол \"stdio\" используется по умолчанию и рекомендуется для большинства пользователей.","settings.serverTransport.pipe.description":"Используйте именованный канал (в Windows) и сокет домена Unix (на Linux/Mac) для связи с сервером Black.","settings.serverTransport.stdio.description":"Используйте стандартные потоки ввода/вывода для связи с сервером Black.","settings.showNotifications.always.description":"Уведомления демонстрируются для всех элементов, которые сервер выбирает для отображения при форматировании файлов Python.","settings.showNotifications.description":"Определяет, когда уведомления отображаются этим расширением.","settings.showNotifications.off.description":"Все уведомления отключены, все ошибки и предупреждения форматирования файлов Python по-прежнему доступны в журналах.","settings.showNotifications.onError.description":"Уведомления отображаются только в случае ошибки при форматировании файлов Python.","settings.showNotifications.onWarning.description":"Уведомления отображаются для любых ошибок и предупреждений при форматировании файлов Python."}
