{"command.restartServer":"Server neu starten","extension.description":"Formatierungsunterstützung für Python-Dateien über Black-Formatierer.","settings.args.description":"Argumente, die an Black übergeben werden, um Python-Dateien zu formatieren. Jedes Argument sollte als separate Zeichenfolge im Array bereitgestellt werden. \n Beispiel: \n \"\"black-formatter.args\" = [\"--config\", \"<file>\"]\"","settings.cwd.description":"Legt das aktuelle Arbeitsverzeichnis fest, das zum Formatieren von Python-Dateien mit Schwarz verwendet wird. Standardmäßig wird das Stammverzeichnis des Arbeitsbereichs \"${workspaceFolder}\" verwendet. Sie können es auf \"${fileDirname}\" festlegen, um den übergeordneten Ordner der Datei zu verwenden, die als Arbeitsverzeichnis für Schwarz formatiert wird.","settings.importStrategy.description":"Definiert, welche Black-Formatierungsbinärdatei zum Formatieren von Python-Dateien verwendet werden soll. Bei Festlegung auf \"useBundled\" verwendet die Erweiterung die Black-Formatiererbinärdatei, die mit der Erweiterung ausgeliefert wird. Bei Festlegung auf \"fromEnvironment\" versucht die Erweiterung, die Black-Formatierungsprogrammbinärdatei und alle Abhängigkeiten zu verwenden, die in der aktuell ausgewählten Umgebung verfügbar sind. **Hinweis**: Wenn die Erweiterung in der ausgewählten Umgebung keine gültige BlackFormatter-Binärdatei finden kann, wird ein Fallback auf die Verwendung der Binärdatei ausgeführt, die mit der Erweiterung ausgeliefert wird. Die Einstellung \"black-formatter.path\" hat Vorrang und überschreibt das Verhalten von \"black-formatter.importStrategy\".","settings.importStrategy.fromEnvironment.description":"Verwenden Sie die Black-Binärdatei aus der ausgewählten Python-Umgebung. Wenn die Erweiterung keine gültige Black-Binärdatei findet, wird ein Fallback auf die Verwendung der gebündelten Version von Black ausgeführt.","settings.importStrategy.useBundled.description":"Verwenden Sie immer die gebündelte Version von Black, um Python-Dateien zu formatieren.","settings.interpreter.description":"Pfad zu einer ausführbaren Python-Datei oder zu einem Befehl, der zum Starten des Black-Servers und eines beliebigen Unterprozesses verwendet wird. Akzeptiert ein Array aus einer einzelnen oder mehreren Zeichenfolgen. Bei Festlegung auf \"[]\" verwendet die Erweiterung den Pfad zum ausgewählten Python-Interpreter. Wenn Sie einen Befehl übergeben, sollte jedes Argument als separate Zeichenfolge im Array bereitgestellt werden.","settings.path.description":"Pfad oder Befehl, der von der Erweiterung zum Formatieren von Python-Dateien mit Black verwendet werden soll. Akzeptiert ein Array aus einer einzelnen oder mehreren Zeichenfolgen. Wenn Sie einen Befehl übergeben, sollte jedes Argument als separate Zeichenfolge im Array bereitgestellt werden. Bei Festlegung auf \"[\"black\"]\" wird die Version von Black verwendet, die in der Umgebungsvariablen \"PATH\" verfügbar ist. Hinweis: Die Verwendung dieser Option kann das Formatieren verlangsamen. \n  Beispiele: \n  – \"[\"~/global_env/black\"]\" \n  – \"[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]\"","settings.serverTransport.description":"Wählt das Transportprotokoll aus, das vom Black-Server verwendet werden soll. Bei Festlegung auf „stdio“ verwendet die Erweiterung die standardmäßigen Eingabe-/Ausgabestreams, um mit dem Black-Server zu kommunizieren. Bei Festlegung auf „pipe“ verwendet die Erweiterung eine Named Pipe (unter Windows) oder Unix Domain Socket (unter Linux/Mac), um mit dem Black-Server zu kommunizieren. Das Transportprotokoll „stdio“ ist die Standardoption und wird für die meisten Benutzer empfohlen.","settings.serverTransport.pipe.description":"Verwenden Sie eine Named Pipe (unter Windows) und Unix Domain Socket (unter Linux/mac), um mit dem Black-Server zu kommunizieren.","settings.serverTransport.stdio.description":"Verwenden Sie die standardmäßigen Eingabe-/Ausgabestreams, um mit dem Black-Server zu kommunizieren.","settings.showNotifications.always.description":"Benachrichtigungen werden für alles angezeigt, was der Server beim Formatieren von Python-Dateien anzeigen will.","settings.showNotifications.description":"Steuert, wann Benachrichtigungen von dieser Erweiterung angezeigt werden.","settings.showNotifications.off.description":"Alle Benachrichtigungen sind deaktiviert. Alle Fehler oder Warnungen beim Formatieren von Python-Dateien sind weiterhin in den Protokollen verfügbar.","settings.showNotifications.onError.description":"Benachrichtigungen werden nur im Falle eines Fehlers beim Formatieren von Python-Dateien angezeigt.","settings.showNotifications.onWarning.description":"Beim Formatieren von Python-Dateien werden Benachrichtigungen zu Fehlern und Warnungen angezeigt."}
