{"command.restartServer":"Ponowne uruchamianie serwera","extension.description":"Obsługa formatowania plików w języku Python przy użyciu narzędzia do formatowania Black.","settings.args.description":"Argumenty przekazane do narzędzia Black na potrzeby formatowania plików w języku Python. Każdy argument powinien być podany jako oddzielny ciąg w tablicy. \n Przykład: \n „\"black-formatter.args\" = [\"--config\", \"<file>\"]”","settings.cwd.description":"Ustawia bieżący katalog roboczy używany do formatowania plików języka Python przy użyciu programu Black. Domyślnie używa katalogu głównego obszaru roboczego „${workspaceFolder}”. Możesz ustawić dla niego wartość „${fileDirname}”, aby użyć folderu nadrzędnego pliku sformatowanego jako katalog roboczy dla programu Black.","settings.importStrategy.description":"Definiuje, które dane binarne narzędzia do formatowania Black mają być używane do formatowania plików w języku Python. Po ustawieniu wartości na „useBundled” rozszerzenie będzie używać danych binarnych narzędzia Black dostarczonych z rozszerzeniem. Po ustawieniu wartości na „fromEnvironment” rozszerzenie podejmie próbę użycia danych binarnych narzędzia do formatowania Black i wszystkich zależności dostępnych w obecnie wybranym środowisku. **Uwaga**: Jeśli rozszerzenie nie może znaleźć prawidłowych danych binarnych narzędzia do formatowania Black w wybranym środowisku, nastąpi powrót do użycia danych binarnych dostarczonych z rozszerzeniem. Ustawienie „black-formatter.path” ma pierwszeństwo i przesłania zachowanie elementu „black-formatter.importStrategy”.","settings.importStrategy.fromEnvironment.description":"Użyj danych binarnych narzędzia Black z wybranego środowiska języka Python. Jeśli rozszerzenie nie może odnaleźć prawidłowych danych binarnych narzędzia Black, powróci do używania dołączonej do pakietu wersji narzędzia Black.","settings.importStrategy.useBundled.description":"Zawsze formatuj pliki w języku Python przy użyciu dołączonego do pakietu narzędzia Black.","settings.interpreter.description":"Ścieżka do pliku wykonywalnego w języku Python lub polecenia, które będzie używane do uruchamiania serwera narzędzia Black i dowolnego podprocesu. Akceptuje tablicę jednego lub wielu ciągów. Po ustawieniu wartości „[]” rozszerzenie użyje ścieżki do wybranego interpretera języka Python. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy.","settings.path.description":"Ścieżka lub polecenie, które ma być używane przez rozszerzenie do formatowania plików w języku Python za pomocą narzędzia Black. Akceptuje tablicę jednego lub wielu ciągów. W przypadku przekazywania polecenia każdy argument powinien być dostarczany jako oddzielny ciąg w tablicy. W przypadku ustawienia wartości „[\"black\"]” będzie używana wersja narzędzia Black dostępna w zmiennej środowiskowej „PATH”. Uwaga: użycie tej opcji może spowolnić formatowanie. \n  Przykłady: \n  — „[\"~/global_env/black\"]” \n  — „[\"conda\", \"run\", \"-n\", \"lint_env\", \"python\", \"-m\", \"black\"]”","settings.serverTransport.description":"Wybiera protokół transportu, który ma być używany przez serwer Black. Po ustawieniu opcji „stdio” rozszerzenie będzie używać standardowych strumieni wejściowych/wyjściowych do komunikowania się z serwerem Black. Po ustawieniu opcji „pipe” rozszerzenie będzie używać nazwanego potoku (w systemie Windows) lub gniazda domeny Unix (w systemie Linux/Mac) do komunikowania się z serwerem Black. Protokół transportu „stdio” jest domyślną i rekomendowaną opcją dla większości użytkowników.","settings.serverTransport.pipe.description":"Użyj nazwanego potoku (w systemie Windows) i gniazda domeny Unix (w systemie Linux/Mac) do komunikacji z serwerem Black.","settings.serverTransport.stdio.description":"Użyj standardowych strumieni wejściowych/wyjściowych, aby komunikować się z serwerem Black.","settings.showNotifications.always.description":"Powiadomienia są wyświetlane dla wszystkiego, co serwer wybierze do wyświetlenia podczas formatowania plików w języku Python.","settings.showNotifications.description":"Określa, kiedy powiadomienia są wyświetlane przez to rozszerzenie.","settings.showNotifications.off.description":"Wszystkie powiadomienia są wyłączone, wszelkie błędy lub ostrzeżenia podczas formatowania plików w języku Python są nadal dostępne w dziennikach.","settings.showNotifications.onError.description":"Powiadomienia są wyświetlane tylko w przypadku błędu podczas formatowania plików w języku Python.","settings.showNotifications.onWarning.description":"Podczas formatowania plików w języku Python wyświetlane są powiadomienia o błędach i ostrzeżeniach."}
